{
    "id": 58,
    "description": "Data una lista di stringhe, i cui caratteri sono nell'insieme {'N', 'S', 'E', 'O'}, modifica la lista togliendo le stringhe e mettendo numeri interi, ritorna il numero totale di caratteri presenti nella lista.",
    "text": "\n    La funzione es5(lista) che presa\n    - una lista di stringhe  i cui caratteri sono nell'insieme { 'N','E','S','O'},\n    modifica distruttivamente la lista e restituisce il numero totale di caratteri presente\n    nella lista (vale a dire la somma del numero di caratteri delle stringhe presenti nella lista).\n    Ogni stringa rappresenta una sequenza di mosse effettuate da un robottino su di una griglia:\n    il robottino puo' spostarsi da una cella ad una delle celle adiacenti nelle 4 direzioni.\n    Ogni carattere della stringa rappresenta una mossa in una delle 4 direzioni:\n    N sta per una mossa verso la cella  alto, E per una mossa verso la cella a destra,\n    S per una mossa verso la cella in basso basso e O per una mossa verso la cella a sinistra.\n    La stringa rappresenta dunque un cammino che dalla cella di pertanza permette di\n    raggiungere una certa cella di destinazione.\n    Al termine della funzione ciascuna stringa della lista va sostituita da un numero. Il numero\n    rappresenta il numero minimo di mosse necessarie al robottino per andare dalla cella\n    iniziale alla cella destinazione individuata dalla stringa.\n    Ad esempio per lista=[ 'NS', 'NEESS', 'NNOOO','NNEESSO'],\n    al termine la funzione restituisce il numero 19 e la lista risulta essere [0,3,5,1]\n    ",
    "algorithm": "Inizializza un dizionario con le 4 mosse possibili\n\tN = (-1,0)\n\tS = (1, 0)\n\tE = (0, 1)\n\tO = (0, -1)\ninizializza un counter per i caratteri\nper ogni stringa della lista:\n\tinizializza le coordinate x, y a 0\n\tper ogni carattere della stringa:\n\t\tse il carattere è una mossa valida:\n\t\t\taumenta il counter dei caratteri\n\t\t\taggiorna la x e la y in base ai valori del dizionario\n\tcambia la stringa con la somma del valore assoluto di x e y\nritorna il counter dei caratteri",
    "tags": ["Liste", "Stringhe"],
    "effort": 4,
    "clues": [],
    "from": "recupero-23-1-18"
}