{
    "id": 57,
    "description": "Data una griglia NxN, se la griglia rappresenta un puzzle di grattacieli, ritorna le 4 liste Nord, Est Sud, Ovest, altrimenti ritorna 4 liste vuote",
    "text": "\n     Il puzzle dei grattacieli posiziona dei grattacieli in una griglia quadrata NxN in modo\n     che ogni riga e colonna contenga solo grattacieli di altezza diversa (valori interi da 1 a N)\n     Per ciascuna riga e colonna, lungo i 4 lati della griglia all'inizio è dato solo il numero\n     di grattacieli che sono visibili da quel lato lungo quella riga/colonna.\n     Date le quattro liste Nord, Est, Sud e Ovest ciascuna di lunghezza N tali che per 0<i<N:\n    - la lista Nord e' tale che Nord[i] contiene il numero di grattaceli visibili  nella colonna i della griglia guardando da nord.\n    - la lista Est e' tale che Est[i] contiene il numero di grattaceli visibili  nella riga i della griglia guardando da est.\n    - la lista Sud e' tale che Sud[i] contiene il numero di grattaceli visibili nella colonna i della griglia guardando da sud.\n    - la lista Ovest e' tale che Ovest[i] contiene il numero di grattaceli visibili riga i della griglia guadando da ovest.\n     il gioco consiste nel trovare le posizioni dei grattacieli.\n\n    Realizzate la funzione es4(griglia) che, data\n    - una griglia quadrata NxN (rappresentata tramite lista di liste in cui ciascuna lista e'\n    una riga della matrice) se la griglia rappresenta un puzzle dei grattacieli deve restituire\n    una tupla in cui compaiono nell'ordine le 4 liste Nord, Est, Sud e Ovest.\n    Qualora la griglia non sia un puzzle per grattacieli (vale a dire che nelle righe o colonne\n    della  griglia  ci sono numeri ripetuti o numeri al di fuori del range che va da 1 a N o\n    valori non numerici) allora la funzione restituisce 4 liste vuote.\n    Ad esempio per griglia= [[1,2,3,4],[4,1,2,3],[3,4,1,2],[2,3,4,1]] viene restituita la tupla\n    ([2,2,2,1],[1,2,2,2],[3,2,1,4],[4,1,2,3]).\n    Per griglia= [[1,2,3,4],[4,1,'c',3],[3,4,1,2],[2,3,4,1]] oppure\n    griglia= [[1,2,3,4],[4,1,2,3],[3,4,2,1],[2,3,4,1]]\n    oppure griglia= [[1,2,3,4],[4,1,2,3],[3,4,1,2],[2,3,6,1]] viene restituita la tupla([],[],[],[]).\n    ",
    "algorithm": "dichiariamo una funzione check(griglia) che controlla se la griglia è un puzzle di grattacieli\n\ndichiariamo una funzione countSky(griglia, scan, d), che dati la griglia, un carattere tra ('r', 'c') e uan direzione, ritorna la lista dei grattacieli visti da una delle 4 direzioni N, E, S, O\n\n\nla nostra funzione sarà quindi:\n\tinizializza le 4 liste N, S, E, O\n\tse la griglia è un puzzle:\n\t\tN = countSky(griglia, 'c', 1)\n\t\tS = countSky(griglia, 'c', -1)\n\t\tE = countSky(griglia, 'r', -1)\n\t\tO = countSky(griglia, 'r', -1)\n\tritorna N, E, S, O",
    "tags": ["Matrici"],
    "effort": 6,
    "clues": [],
    "from": "recupero-23-1-18"
}