{
    "id": 67,
    "description": "Dati un path nel filesystem, la funzione esplora ricorsivamente la directory corrispondente e ritorna un dizionario con chiavi le estensioni dei file trovati e valore un intero.",
    "text": "ATTENZIONE: e' VIETATO usare la funzione os.walk o altre funzioni di libreria che \n    permettono di cercare tutti i file presenti in una directory. \n    (la directory la dovete esplorare voi)\n    \n    Si definisca la funzione ricorsiva (o che fa uso di vostre funzioni ricorsive) es18 che:\n    - riceve come argomento un path del filesystem\n    - esplora ricorsivamente la directory corrispondente e torna un dizionario.\n    Il dizionario ha come chiave le estensioni dei file trovati nella directory \n    (ovvero gli ultimi 3 caratteri del nome dei file, es: 'txt', 'pdf', 'png').\n    Il valore associato a ciascuna chiave K e' la distanza (differenza delle profondita')\n    tra il piu' profondo file che ha quella estensione e il meno profondo.\n    Assumete che i file contenuti nella directory path siano a profondita' 0.\n    Esempio:\n    se nella directory con path='A1' sono presenti i soli due file di tipo 'txt'\n        A1/a/b/c/d/e/f/g/h/pippo.txt    a profondita' 8    (contando A1 = 0)\n        A1/d/f/pappo.txt                a profondita' 2\n        risultato contiene la coppia chiave: valore\n        'txt' : 6\n",
    "algorithm": "definiamo una funzione minmassimi(path, m, M, prof)\n\tdati un path ad una directory, due dizionari m e M, con chiave l'estensione e valore l'altezza minima e massima rispettivamente, e prof la profondità della directory\n\tper ogni filename nella directory:\n\t\tcostruisco il path al filename\n\t\tse il path è una directory:\n\t\t\tchiamo minmassimi(nuovo_path, m, M, prof+1)\n\t\taltrimenti:\n\t\t\tprelevo l'estensione del file\n\t\t\taggiorno il valore per l'estensione nei dizionari m e M tramite le funzioni min(..) e max(..)\n\nla funzione es67(path) sarà:\n\tinizializzo i due dizionari minimi e massimi\n\tchiamo la funzione minmassimi(path, minimi, massimi, 0)\n\tritorno un dizionario con chiavi le estensioni nei due dizionari e valori la differenza dei valori nei due dizionari",
    "tags": ["Ricorsione", "Ricerca File", "Dizionari"],
    "effort": 9,
    "clues": [],
    "from": "esame-12-7-18"
}