{
    "id": 1, 
"description": "Presi due alberi AlberoBinario, con struttura uguale, costruisce un terzo AlberoBinario con la stessa struttura degli alberi in input e ne restituisce la radice", 
    "text": "\n    Es 1: 6 punti\n    Si definisca la funzione es1(tree1,tree2) ricorsiva (o che fa uso di funzioni o \n    metodi ricorsive/i) che:\n    - riceve come argomenti 'tree1' e 'tree2' due alberi  formati da nodi di tipo \n      AlberoBinario definito nella libreria albero.py allegata\n    - Genera un albero di tipo AlberoBinario\n    - torna come risultato la radice dell'albero generato.\n    I due alberi in input hanno identica struttura ma l'informazione contenuta nel campo \n    valore dei nodi corrispondenti puo' essere diversa. L'albero da generare deve avere  \n    la stessa struttura dei due alberi in input e il valore dei nodi del nuovo albero viene \n    calcolato in base alla seguente regola.\n    Siano   x e y i due nodi corrispondenti di tree1 e \n    tree2 rispettivamente, \n    - si effettua la somma dei valori  dei  nodi presenti nel sottoalbero in tree1 radicato in x. \n    - si effettua la somma dei valori dei  nodi presenti nel sottoalbero in  tree2 radicato in y.\n    -si assegna al nodo corrispondente la somma delle due somme ottenute. \n    Esempio: se tree1 e tree2 sono i due alberi sotto a sinistra allora tree3 sara' \n    l'albero sotto a destra\n    \n    ATTENZIONE: È VIETATO USARE LE FUNZIONE DELLA CLASSE AlberoBinario\n\n             1              7            90           |\n            /\\             /\\            /\\           |\n           2  3           1  3          76  6         |\n          / \\            / \\           / \\            |\n        4    5          4   6        36  37           |\n       /    /          /   /         /   /            |\n      6    7          5   2         28 26             |\n     /     \\         /    \\        /    \\             |\n     8      9       9      8      17    17            | \n     \n\n     I due alberi in input non vanno modificati\n    ", 
    "algorithm": "", 
    "tags": ["Ricorsione", "Alberi"], 
    "effort": 6,
    "clues": [],
    "from":"esame-7-11-18"
}
