{
    "id": 22,
    "description": "Dati un file PNG e un file JSON, leggo il file PNG lo codifico in una matrice di stringhe, ogni pixel diventa una stringa di 9 caratteri, salva la matrice codificata nel file JSON e ritorna la stringa lessicograficamente piu' piccola, tra quelle che compaiono nella matrice con frequenza maggiore",
    "text": "\n    Abbiamo un file contenente un'immagine PNG che bisogna leggere, codificare e infine salvare \n    in un file JSON.\n    L'immagine va codificata in una matrice (lista di liste) M di stringhe \n    di dimensioni w per h dove w e' l'ampiezza  dell'immagine  mentre h e' la sua altezza. \n    La cella M[i][j] deve contenere una stringa \n    di 9 caratteri ottenuti concatenando nell'ordine le componenti R, G e B del colore del pixel \n    corrispondente nell'immagine (dopo aver espresso ciascuno dei tre interi come stringa di \n    tre caratteri). Ad esempio  il colore (0,0,0) sara' codificato come '000000000' e \n    il colore (50,10,200) come '050010200'.\n    Bisogna infine determinare la stringa di 9 caratteri che e' presente nella matrice \n    con maggior frequenza (a parita' di frequenza quella che precede lessicograficamente le altre).\n     \n    \n    Scrivete la funzione es6(filePng, fileJson) che riceve come argomenti:\n        :param filePng:  il path del file PNG che dovete codificare\n        :param fileJson: il path del file json dove salvare la codifica ottenuta\n        :return: la stringa lessicograficamente piu' piccola tra quelle che compaiono \n        nella matrice con piu' frequenza.\n    ",
    "algorithm": "Definisco due funzioni:\ncodifica(tupla)\n\tritorna la stringa del pixel codificata\nadatta(x)\n\tritorna un'intero codificato in una stringa di 3 caratteri\n\ncarico l'immagine PNG\ninizializzo un dizionario vuoto e una matrice di stringhe vuote uguale alla matrice dell'immagine\nper ogni pixel:\n\tcodifico il pixel\n\tsalvo la stringa di 9 caratteri nalla matrice\n\taggiorno il contatore nel dizionario per quel pixel\nsalvo la matrice nel file JSON\nordino la matrice composta dagli items del dizionario\nritorno la prima stringa della matrice",
    "tags": ["Matrici", "Immagini", "Stringhe"],
    "effort": 5,
    "clues": [],
    "from": "recupero-12-7-18"
}
