{
    "id": 70,
    "description": "Dati un path ad una directory, una lista di estensioni di file e una lista di stringhe, cerca nella directory, ricorsivamente, quante volte le stringhe della lista sono presenti nei file che non hanno estensioni tra quelle della lista, ritorna un dizionario con i risultati.",
    "text": "Si definisca la funzione  ricorsiva (o che usa una vostra funzione ricorsiva) es3(dir, estensioni, parole),\n    che deve contare quante volte le parole indicate sono presenti nei files che NON hanno le estensioni indicate,\n    e che riceve come argomenti:\n        dir: la directory in cui cercare\n        estensioni: una lista di stringhe \"estensioni\" (le ultime lettere del nome dei files che evitiamo)\n        parole: una lista di stringhe che non contengono spazi/tab/accapo, che vanno cercate nei files\n                senza considerare la differenza tra maiuscole e minuscole.\n    La funzione deve tornare un dizionario contenente come chiavi le parole cercate (in minuscolo)\n    e come valori il numero di volte (>0) che queste parole appaiono (indipendentemente dalle maiuscole/minuscole)\n    complessivamente nei files che NON hanno le estensioni indicate.\n    Nota: una parola non deve apparire nel dizionario in output se nessun file con estensione diversa da quelle indicate la contiene.\n    Nota: assumete che tutti i file presenti nelle directories siano file di testo indipendentemente dalla loro estensione.\n\n    Test:   date alcune directory che contengono alcuni file con estensioni diverse a diverse profondita',\n            contare alcune parole (in mixed-case) e controllare il dizionario risultante\n    Test:   che la funzione sia ricorsiva\n",
    "algorithm": "Converti tutte le parole della lista in minuscolo\ninizializza il dizionario count per ogni parola con valore 0\nper ogni nomefile nella directory:\n\tcrea il path del file\n\tse il file è una directory:\n\t\tchiama la funzione es70(..) sulla directory, salva il risultato ritornato in una variabile diz\n\t\tper ogni chiave-valore di diz:\n\t\t\taggiorna il dizionario count\n\tse il file non termina con una delle estensioni:\n\t\tapri il file:\n\t\t\tper ogni riga:\n\t\t\t\tper ogni parola:\n\t\t\t\t\ttrasforma la parola in minuscolo\n\t\t\t\t\tse la parola è in parole:\n\t\t\t\t\t\taumenta il counter della parola nel dizionario count\nper ogni chiave k:\n\tse iol valore della chiave è 0:\n\t\telimina la chiave dal dizionario count\nritorna il dizionario count",
    "tags": ["Ricerca File", "Ricorsione", "File"],
    "effort": 4,
    "clues": [],
    "from": "esame-15-2-18"
}