{
    "id": 13, 
    "description": "Date due immagini in input, modifica la prima immagine e salva le modifiche nella seconda, ritorna il numero di pixel distinti dell'immagine", 
    "text": "    \n    Es 12: 4 punti\n    Progettare la  funzione es12(fimm,fimm1) che, \n    - riceve gli  indirizzi fimm e  fimm1 di due file .PNG. \n    - legge l'immagine da fimm ne modifica i colori dei pixel e  la salva poi \n      all'indirizzo fimm1.\n    - restituisce infine il numero di colori DIFFERENTI presenti nell'immagine modificata.\n      I colori dei pixel dalla nuova immagine si ottengono a partire da quelli \n      dell'immagine originaria con la seguente  procedura:.\n      le tuple dei DIFFERENTI colori presenti nella prima immagine vengono ordinate in \n      ordine crescente.\n      La sequenza ordinata di tuple  che si ottiene viene suddivisa a gruppi di 50 (se il \n      numero totale di tuple non e' un multiplo di 50 allora l'ultimo gruppo avra' \n      meno di 50 elementi). \n      I colori corrispondenti alle tuple che compaiono come  primo elemento di \n      ciascun gruppo saranno i colori assegnati ai pixel dell'immagine.\n      tutti i pixel che avevano colori corrispondenti a tuple finite in uno stesso \n      gruppo avranno come colore quello corrispondente alla prima tupla del gruppo.\n      Ad esempio i pixel che avevano colori corrispondenti alle tuple finite nelle prime 50 posizioni \n      della sequenza ordinata  avranno ora tutti lo stesso colore (dato dal colore corrispondente \n      alla tupla che occupa la prima posizione  della sequenza), i pixel \n      che avevano colori le cui tuple  nella sequenza occupano le posizioni \n      da 50 a 99 avranno tutti lo stesso  colore (corrispondente alla tupla in posizione  \n      50) ecc. ecc. \n      Sull'immagine Fig1.png la funzione deve produrre il file RisFig1.png e restituire il numero ?\n    Per caricare e salvare i file PNG si possono usare load e save della libreria immagini.\n    ", 
    "algorithm": "Carica l'immagine 1\nsalva i pixel distinti in una lista e ordinali\nsalva quanti gruppi di pixel si hanno\ndividi i pixel nei gruppi da 50\nper ogni riga di img1\n\tper ogni colonna di img1\n\tper ogni elemento della lista dei gruppi di pixel\n\t\tse il pixel è nella lista\n\t\t\timposta il pixel al primo elemento della lista\nsalva l'mmagine\nritorna il numero di pixel distinti dell'immagine", 
    "tags": ["Immagini"], 
    "effort": 4,
    "clues": [],
    "from":"esame-8-1-19"
}
