{
    "id": 60,
    "description": "Dati in input due file, la funzione modifica la matrice contenuta nel primo file e la salva nel secondo, torna un intero.",
    "text": "\n    La funzione es60(ftesto, ftestoMod) che modifica il contenuto del file di testo il cui\n    percorso e' dato da ftesto, registra il file modificato nel file di testo il cui indirizzo\n    e' in ftestoMod e restituisce un intero.\n    Il file di testo ftesto contiene una matrice che ha per elementi elementi interi tra 1 e 9.\n    Ogni riga del file di testo contiene una riga della matrice ed i vari interi della riga sono\n    separati tra loro da uno spazio.\n    Una colonna della matrice si dice \"dispari\" se la maggior parte dei suoi elementi e' dispari.\n    (se il numero di elementi dispari è uguale al numero di elementi pari, la riga non è dispari)\n    In ftestoMod deve essere registrata la matrice dove tutti gli elementi  che occorrono\n    in colonne \"dispari\" sono stati sostituiti dalla cifra zero.\n    La funzione restituisce il numero di colonne della matrice che sono state azzerate.\n    Ad esempio se il file in ftesto contiene la matrice:\n    1 2 3 4 5 7\n    3 4 4 4 4 5\n    3 1 4 6 3 1\n    2 5 8 1 7 3\n    al termine della funzione verra' restituito il numero 3 e il file ftestoMod conterra' la matrice\n    0 2 3 4 0 0\n    0 4 4 4 0 0\n    0 1 4 6 0 0\n    0 5 8 1 0 0\n    ",
    "algorithm": "Inizializza una matrice vuota\napri il primo file\n\tper ogni riga del file\n\t\taggiungi la riga, come lista di interi, alla matrice\nsalva in w e h le dimensioni della matrice\ninizializza un counter per le colonne dispari\nper c che va da 0 a w:\n\tinizializza il counter per i numeri dispari della riga a 0\n\tper r che va da 0 a h:\n\t\taggiorna il counter dei numeri dispari\n\tse il counter dei numeri dispari è maggiore dei numeri pari:\n\t\taumenta il counter delle colonne dispari\n\t\tper r che va da 0 a h:\n\t\t\tmetti a 0 gli elementi della colonna (mtr[r][c] = 0)\nsalva la matrice nel secondo file\nritorna il counter delle colonne dispari",
    "tags": ["File", "Matrici"],
    "effort": 6,
    "clues": [],
    "from": "recupero-23-1-18"
}